app/controllers/api/comments_controller.rb

INSERT INTO "comments" ("body", "user_id", "post_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["body", "123456"], ["user_id", 1], ["post_id", 8], ["created_at", "2022-05-03 17:30:56.580505"], ["updated_at", "2022-05-03 17:30:56.580505"]]
---
    def create

        @comment = Comment.new(comment_params)
        if @comment.save!

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 23], ["LIMIT", 1]]
UPDATE "comments" SET "body" = $1, "updated_at" = $2 WHERE "comments"."id" = $3  [["body", "make a idea  ??"], ["updated_at", "2022-05-03 17:13:06.779470"], ["id", 30]]
---
    def update
        @comment = Comment.find(params[:id])

        if @comment.update(comment_params)

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 27], ["LIMIT", 1]]
DELETE FROM "comments" WHERE "comments"."id" = $1  [["id", 27]]
---
    def destroy
        @comment = Comment.find(params[:id])

        if @comment.destroy