app/controllers/api/posts_controller.rb

INSERT INTO "posts" ("body", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["body", "test"], ["user_id", 1], ["created_at", "2022-05-03 16:42:17.127555"], ["updated_at", "2022-05-03 16:42:17.127555"]]
---
    def create

        @post = Post.new(post_params)
        if @post.save!

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
DELETE FROM "posts" WHERE "posts"."id" = $1  [["id", 9]]
---
    def destroy
        @post = Post.find(params[:id])

        if @post.destroy