app/controllers/api/users_controller.rb

    def create
        @user = User.new(user_params)

        if @user.save
---
INSERT INTO "users" ("fname", "lname", "email", "birthday", "gender", "bio", "password_digest", "session_token", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"