app/views/api/posts/show.json.jbuilder


json.comments @post.comments.each do |comment|
---
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = $1  [["post_id", 9]]